QX-C2000-DSP/f280049revb_evb_examples/examples_core0/examples/spi/spi_tfcard/TFdriver.h
#ifndef TFDRIVER_TFDRIVER_H_
#define TFDRIVER_TFDRIVER_H_

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C" {
#endif

//
// Included Files
//

#include "driverlib.h"
#include "device.h"

extern uint8_t SD_TYPE;
/* Private typedef -----------------------------------------------------------*/
typedef enum
{
    FAILED = 0,
    PASSED = !FAILED
} TestStatus;
// SD卡类型
#define ERR  0x00
#define MMC  0x01
#define V1   0x02
#define V2   0x04
#define V2HC 0x06

#define DUMMY_BYTE    0xFF
#define MSD_BLOCKSIZE 512

// CMD定义
#define CMD0  0 // 卡复位
#define CMD1  1
#define CMD8  8  // 命令8 ，SEND_IF_COND
#define CMD9  9  // 命令9 ，读CSD数据
#define CMD10 10 // 命令10，读CID数据
#define CMD12 12 // 命令12，停止数据传输
#define CMD16 16 // 命令16，设置SectorSize 应返回0x00
#define CMD17 17 // 命令17，读sector
#define CMD18 18 // 命令18，读Multi sector
#define CMD23 23 // 命令23，设置多sector写入前预先擦除N个block
#define CMD24 24 // 命令24，写sector
#define CMD25 25 // 命令25，写Multi sector
#define CMD41 41 // 命令41，应返回0x00
#define CMD55 55 // 命令55，应返回0x01
#define CMD58 58 // 命令58，读OCR信息
#define CMD59 59 // 命令59，使能/禁止CRC，应返回0x00

/**
 * @brief  Commands: CMDxx = CMD-number | 0x40
 */
#define SD_CMD_GO_IDLE_STATE      0  /*!< CMD0 = 0x40 */
#define SD_CMD_SEND_OP_COND       1  /*!< CMD1 = 0x41 */
#define SD_CMD_SEND_IF_COND       8  /*!< CMD8 = 0x48 */
#define SD_CMD_SEND_CSD           9  /*!< CMD9 = 0x49 */
#define SD_CMD_SEND_CID           10 /*!< CMD10 = 0x4A */
#define SD_CMD_STOP_TRANSMISSION  12 /*!< CMD12 = 0x4C */
#define SD_CMD_SEND_STATUS        13 /*!< CMD13 = 0x4D */
#define SD_CMD_SET_BLOCKLEN       16 /*!< CMD16 = 0x50 */
#define SD_CMD_READ_SINGLE_BLOCK  17 /*!< CMD17 = 0x51 */
#define SD_CMD_READ_MULT_BLOCK    18 /*!< CMD18 = 0x52 */
#define SD_CMD_SET_BLOCK_COUNT    23 /*!< CMD23 = 0x57 */
#define SD_CMD_WRITE_SINGLE_BLOCK 24 /*!< CMD24 = 0x58 */
#define SD_CMD_WRITE_MULT_BLOCK   25 /*!< CMD25 = 0x59 */
#define SD_CMD_PROG_CSD           27 /*!< CMD27 = 0x5B */
#define SD_CMD_SET_WRITE_PROT     28 /*!< CMD28 = 0x5C */
#define SD_CMD_CLR_WRITE_PROT     29 /*!< CMD29 = 0x5D */
#define SD_CMD_SEND_WRITE_PROT    30 /*!< CMD30 = 0x5E */
#define SD_CMD_SD_ERASE_GRP_START 32 /*!< CMD32 = 0x60 */
#define SD_CMD_SD_ERASE_GRP_END   33 /*!< CMD33 = 0x61 */
#define SD_CMD_UNTAG_SECTOR       34 /*!< CMD34 = 0x62 */
#define SD_CMD_ERASE_GRP_START    35 /*!< CMD35 = 0x63 */
#define SD_CMD_ERASE_GRP_END      36 /*!< CMD36 = 0x64 */
#define SD_CMD_UNTAG_ERASE_GROUP  37 /*!< CMD37 = 0x65 */
#define SD_CMD_ERASE              38 /*!< CMD38 = 0x66 */

#define SD_CMD_READ_OCR         58 /*!< CMD58 */
#define SD_CMD_APP_CMD          55 /*!< CMD55 返回0x01*/
#define SD_ACMD_SD_SEND_OP_COND 41 /*!< ACMD41  返回0x00*/

// SD卡的类型
#define SD_TYPE_NOT_SD 0 // 非SD卡
#define SD_TYPE_V1     1 // V1.0的卡
#define SD_TYPE_V2     2 // SDSC
#define SD_TYPE_V2HC   4 // SDHC

// 数据写入回应字意义
#define MSD_DATA_OK          0x05
#define MSD_DATA_CRC_ERROR   0x0B
#define MSD_DATA_WRITE_ERROR 0x0D
#define MSD_DATA_OTHER_ERROR 0xFF
// SD卡回应标记字
#define MSD_RESPONSE_NO_ERROR    0x00
#define MSD_IN_IDLE_STATE        0x01
#define MSD_ERASE_RESET          0x02
#define MSD_ILLEGAL_COMMAND      0x04
#define MSD_COM_CRC_ERROR        0x08
#define MSD_ERASE_SEQUENCE_ERROR 0x10
#define MSD_ADDRESS_ERROR        0x20
#define MSD_PARAMETER_ERROR      0x40
#define MSD_RESPONSE_FAILURE     0xFF

/**
 * @brief  Dummy byte
 */
#define SD_DUMMY_BYTE 0xFF

enum _CD_HOLD
{
    HOLD    = 0,
    RELEASE = 1,
};

typedef struct /* Card Specific Data */
{
    uint8_t CSDStruct;           /* CSD structure */
    uint8_t SysSpecVersion;      /* System specification version */
    uint8_t Reserved1;           /* Reserved */
    uint8_t TAAC;                /* Data read access-time 1 */
    uint8_t NSAC;                /* Data read access-time 2 in CLK cycles */
    uint8_t MaxBusClkFrec;       /* Max. bus clock frequency */
    uint16_t CardComdClasses;    /* Card command classes */
    uint8_t RdBlockLen;          /* Max. read data block length */
    uint8_t PartBlockRead;       /* Partial blocks for read allowed */
    uint8_t WrBlockMisalign;     /* Write block misalignment */
    uint8_t RdBlockMisalign;     /* Read block misalignment */
    uint8_t DSRImpl;             /* DSR implemented */
    uint8_t Reserved2;           /* Reserved */
    uint32_t DeviceSize;         /* Device Size */
    uint8_t MaxRdCurrentVDDMin;  /* Max. read current @ VDD min */
    uint8_t MaxRdCurrentVDDMax;  /* Max. read current @ VDD max */
    uint8_t MaxWrCurrentVDDMin;  /* Max. write current @ VDD min */
    uint8_t MaxWrCurrentVDDMax;  /* Max. write current @ VDD max */
    uint8_t DeviceSizeMul;       /* Device size multiplier */
    uint8_t EraseGrSize;         /* Erase group size */
    uint8_t EraseGrMul;          /* Erase group size multiplier */
    uint8_t WrProtectGrSize;     /* Write protect group size */
    uint8_t WrProtectGrEnable;   /* Write protect group enable */
    uint8_t ManDeflECC;          /* Manufacturer default ECC */
    uint8_t WrSpeedFact;         /* Write speed factor */
    uint8_t MaxWrBlockLen;       /* Max. write data block length */
    uint8_t WriteBlockPaPartial; /* Partial blocks for write allowed */
    uint8_t Reserved3;           /* Reserded */
    uint8_t ContentProtectAppli; /* Content protection application */
    uint8_t FileFormatGrouop;    /* File format group */
    uint8_t CopyFlag;            /* Copy flag (OTP) */
    uint8_t PermWrProtect;       /* Permanent write protection */
    uint8_t TempWrProtect;       /* Temporary write protection */
    uint8_t FileFormat;          /* File Format */
    uint8_t ECC;                 /* ECC code */
    uint8_t CSD_CRC;             /* CSD CRC */
    uint8_t Reserved4;           /* always 1*/
} MSD_CSD;

typedef struct /*Card Identification Data*/
{
    uint8_t ManufacturerID; /* ManufacturerID */
    uint16_t OEM_AppliID;   /* OEM/Application ID */
    uint32_t ProdName1;     /* Product Name part1 */
    uint8_t ProdName2;      /* Product Name part2*/
    uint8_t ProdRev;        /* Product Revision */
    uint32_t ProdSN;        /* Product Serial Number */
    uint8_t Reserved1;      /* Reserved1 */
    uint16_t ManufactDate;  /* Manufacturing Date */
    uint8_t CID_CRC;        /* CID CRC */
    uint8_t Reserved2;      /* always 1 */
} MSD_CID;

typedef enum
{
    /**
     * @brief  SD reponses and error flags
     */
    SD_RESPONSE_NO_ERROR    = (0x00),
    SD_IN_IDLE_STATE        = (0x01),
    SD_ERASE_RESET          = (0x02),
    SD_ILLEGAL_COMMAND      = (0x04),
    SD_COM_CRC_ERROR        = (0x08),
    SD_ERASE_SEQUENCE_ERROR = (0x10),
    SD_ADDRESS_ERROR        = (0x20),
    SD_PARAMETER_ERROR      = (0x40),
    SD_RESPONSE_FAILURE     = (0xFF),

    /**
     * @brief  Data response error
     */
    SD_DATA_OK          = (0x05),
    SD_DATA_CRC_ERROR   = (0x0B),
    SD_DATA_WRITE_ERROR = (0x0D),
    SD_DATA_OTHER_ERROR = (0xFF)
} SD_Error;

/**
 * @brief SD Card information
 */
typedef struct
{
    MSD_CSD SD_csd;
    MSD_CID SD_cid;
    uint64_t CardCapacity;  /*!< Card Capacity */
    uint32_t CardBlockSize; /*!< Card Block Size */
} SD_CardInfo;

extern SD_CardInfo SDCardInfo; // 用于存储卡的信息

typedef struct
{
    MSD_CSD CSD;
    MSD_CID CID;
    uint32_t Capacity;  /* Card Capacity */
    uint32_t BlockSize; /* Card Block Size */
    uint16_t RCA;
    uint8_t CardType;
    uint32_t SpaceTotal; /* Total space size in file system */
    uint32_t SpaceFree;  /* Free space size in file system */
} MSD_CARDINFO, *PMSD_CARDINFO;

extern MSD_CARDINFO SD0_CardInfo;
void SPI_CS_HIGH(void);
void SPI_CS_LOW(void);
uint8_t SPI_SendByte(uint8_t data);
uint8_t SD_init(void);
void SD_CS(uint8_t p);
uint32_t SD_GetSectorCount(void);
uint8_t SD_GETCID(uint8_t *cid_data);
uint8_t SD_GETCSD(uint8_t *csd_data);
int MSD0_GetCardInfo(PMSD_CARDINFO SD0_CardInfo);
uint8_t SD_ReceiveData(uint8_t *data, uint16_t len);
uint8_t SD_SendBlock(uint8_t *buf, uint8_t cmd);
uint8_t SD_ReadDisk(uint8_t *buf, uint32_t sector, uint8_t cnt);
uint8_t SD_WriteDisk(uint8_t *buf, uint32_t sector, uint8_t cnt);
void SD_SingleBlockTest(void);
void SD_MultiBlockTest(void);
void Fill_Buffer(uint8_t *pBuffer, uint32_t BufferLength, uint32_t Offset);
TestStatus Buffercmp(uint8_t *pBuffer1, uint8_t *pBuffer2, uint32_t BufferLength);
void SD_Test(void);
#endif /* TFDRIVER_TFDRIVER_H_ */
